Repository: DlsgDeveloper/ImageProcessing
Catalog: BIP/Languages/BIPStrings.*.resx
Languages: es, fr, pt

# UnsupportedImageFormat_STR
source: Unsupported image format!
es: Formato de imagen no admitido!
fr: Format d'image non pris en charge !
pt: Formato de imagem sem suporte!

# ImagePathTo_STR
source: Image path to
es: Ruta de imagen
fr: Chemin de l'image à
pt: Caminho da imagem para

# IsIncorrect_STR
source: is incorrect!
es: no es correcto!
fr: est incorrecte !
pt: é incorreto!

# CanTCreate1BitPixelJPEGFile_STR
source: Can't create 1 bit/pixel JPEG file!
es: No se puede crear el archivo JPEG de 1 bit/píxel!
fr: Impossible de créer 1 fichier JPEG de bits/pixel !
pt: Não é possível criar arquivo JPEG bits/pixel 1!

# Histogram_STR
source: Histogram
es: Histograma
fr: Histogramme
pt: Histograma

# Threshold_STR
source: Threshold
es: Umbral
fr: Seuil
pt: Limiar

# Extreme_STR
source: Extreme
fr: Extrême
pt: Extremo

# NdExtreme_STR
source: 2nd Extreme
es: extreme 2
fr: 2e extrême
pt: 2 extreme

# MinRangeR_STR
source: Min Range R:
es: R: rango min
fr: R: min gamme
pt: R: intervalo min

# MinRange_STR
source: Min Range
es: Gama de min
fr: Gamme min
pt: Intervalo min

# UnsupportedFileFormat_STR
source: Unsupported file format!
es: ¡Formato de archivo no compatible!
fr: Format de fichier non pris en charge!
pt: Formato de arquivo sem suporte!

# CanTResizeBitmap_STR
source: Can't resize bitmap!
es: No se puede cambiar el tamaño de mapa de bits.
fr: Ne peut pas redimensionner bitmap !
pt: Não é possível redimensionar bitmap!

# UnsupportedPixelFormat_STR
source: Unsupported pixel format!
es: Formato de píxel no compatible!
fr: Format de pixel non pris en charge !
pt: Formato de pixel não suportado!

# CanTSharpen1BitPerPixelImage_STR
source: Can't sharpen 1 bit per pixel image!
es: No se puede enfocar 1 bit por imagen!
fr: Ne peut pas aiguiser 1 bit par image pixel !
pt: Não pode aguçar a 1 bit por pixel imagem!

# ZoomMustBeEqualOrLessThan1_STR
source: Zoom must be equal or less than 1.
es: Zoom debe ser igual o inferior a 1.
fr: Zoom doit être égal ou inférieur à 1.
pt: Zoom deve ser igual ou inferior a 1.

# CanTGenerateBitmap_STR
source: Can't generate bitmap
es: No se puede generar el mapa de bits
fr: Impossible de générer le bitmap
pt: Não é possível gerar bitmap

# CanTSaveBitmapToStream_STR
source: Can't save bitmap to stream
es: No se puede guardar el mapa de bits en secuencia
fr: Impossible d'enregistrer image bitmap de flux
pt: Não é possível salvar o bitmap fluxo

# CanTCreateBitmapFromPresentParameters_STR
source: Can't create bitmap from present parameters!
es: No se puede crear el mapa de bits de parámetros presentes!
fr: Ne peut pas créer un bitmap de paramètres présents !
pt: Não é possível criar bitmap de parâmetros presentes!

# SourceDirectoryOrFileDoesnTExist_STR
source: Source directory or file doesn't exist!
es: Archivo o directorio de origen no existe!
fr: Fichier ou répertoire source n'existe pas !
pt: Diretório de origem ou arquivo não existe!

# InvalidParameterUsed_STR
source: Invalid parameter used!
es: Utilizada un parámetro no válido!
fr: Paramètre non valide utilisé !
pt: Parâmetro inválido usado!

# NoImageWasLoaded_STR
source: No image was loaded!
es: No se cargó ninguna imagen!
fr: Aucune image n'était chargée !
pt: Nenhuma imagem foi carregada!

# UnexpectedErrorOccured_STR
source: Unexpected error occured!
es: Ha producido un error inesperado.
fr: Une erreur inattendue s'est produite !
pt: Ocorreu um erro inesperado!

# ThereAreAlready2FingersLocated_STR
source: There are already 2 fingers located!
es: Ya son 2 dedos situados!
fr: Il y a déjà 2 doigts situés !
pt: Já existem 2 dedos localizados!

# FingerRegionMustBeInsideImageClip_STR
source: Finger region must be inside image clip!
es: Región de dedo debe estar dentro de clip de imagen!
fr: Région de doigt doit être à l'intérieur d'image clip !
pt: Região de dedo deve ser dentro de imagens clip!

# FingerRegionSizeIsZero_STR
source: Finger region size is zero!
es: Tamaño de la región de Finger es cero!
fr: Taille de la région doigt est zéro !
pt: Tamanho da região dedo é zero!

# ThereAreAlready2PagesInTheImage_STR
source: There are already 2 pages in the image!
es: Ya hay 2 páginas en la imagen!
fr: Il y a déjà 2 pages dans l'image !
pt: Já há 2 páginas na imagem!

# ConstructPagesFirst_STR
source: Construct Pages First!
es: Construir primero las páginas!
fr: Tout d'abord à la construction de Pages !
pt: Em primeiro lugar, construa páginas!

# CanTRemovePageFrom2PageImage_STR
source: Can't remove page from 2-page image!
es: No se puede eliminar página de imagen de página 2!
fr: Ne peut pas supprimer la page 2-page image !
pt: Não é possível remover a página da imagem da página 2!

# ThereIsOnly1PageInTheImage_STR
source: There is only 1 page in the image!
es: Sólo hay 1 página de la imagen!
fr: Il y a seulement 1 page dans l'image !
pt: Há apenas 1 página na imagem!

# MessageCode_STR
source: Message code:
es: Código de mensaje:
fr: Code de message :
pt: Código de mensagem:

# CurveHasLessThan2Points_STR
source: Curve has less than 2 points!
es: Curva tiene menos de 2 puntos!
fr: Courbe a moins de 2 points !
pt: Curva tem menos de 2 pontos!

# TiffImageWithJpegCompressionIsNotSupported_STR
source: Tiff image with Jpeg compression is not supported in GDI+ !
es: Imagen TIFF con compresión Jpeg no es compatible en GDI +!
fr: Image TIFF avec compression Jpeg n'est pas pris en charge dans GDI + !
pt: Não há suporte para imagem TIFF com compactação Jpeg em GDI +!

# UnsupportedTiffCompression_STR
source: Unsupported Tiff Compression!
es: Compresión Tiff no compatible!
fr: Non pris en charge Tiff Compression !
pt: Não há suporte para compactação de Tiff!

# ThereIsNotSufficientMemoryToOpenFile_STR
source: There is not sufficient memory to open file
es: No hay memoria suficiente para abrir el archivo
fr: Il n'y a pas suffisamment de mémoire pour ouvrir le fichier
pt: Não há memória suficiente para abrir o arquivo

# FromDisk_STR
source: from disk
es: desde el disco
fr: depuis le disque
pt: do disco

# ThereIsNotEnoughMemoryToOpenBitmapFromFile_STR
source: There is not enough memory to open bitmap from file
es: No hay memoria suficiente para abrir el mapa de bits desde archivo
fr: Il n'y a pas assez de mémoire pour ouvrir l'image bitmap du fichier
pt: Não há memória suficiente para abrir o bitmap do arquivo

# ImageFileIsCorrupted_STR
source: Image file is corrupted!
es: Archivo de imagen está dañado!
fr: Fichier de l'image est corrompu !
pt: Arquivo de imagem está corrompido!

# CanTGetImagePropertiesFromFile_STR
source: Can't get image properties from file!
es: No se puede obtener las propiedades de archivo!
fr: Ne peut pas obtenir les propriétés de l'image du fichier !
pt: Não é possível obter propriedades de imagem do arquivo!

# ErrorInFile_STR
source: Error in file
es: Error en el archivo
fr: Erreur dans le fichier
pt: Erro no arquivo

# GIFFileIsCorrupted_STR
source: GIF file is corrupted!
es: Está dañado el archivo GIF!
fr: Fichier GIF est corrompu !
pt: Arquivo GIF está corrompido!

# CanTFindIDATChunkTheFile_STR
source: Can't find 'IDAT' chunk! The file
es: No se puede encontrar fragmentos de 'idat'! El archivo
fr: Ne peut pas trouver le morceau de « idat » ! Le fichier
pt: Não é possível localizar o fragmento 'idat'! O arquivo

# IsEitherCorruptedOrItIsNotPNGFile_STR
source: is either corrupted or it is not PNG file.!
es: está bien dañado o no es archivo PNG.!
fr: est soit endommagé ou il n'est pas fichier PNG. !
pt: ou está corrompida ou não é arquivo PNG.!

# CanTOpenImage_STR
source: Can't open image!
es: No se puede abrir la imagen!
fr: Impossible d'ouvrir image !
pt: Não é possível abrir imagem!

# CanTAnalyzeImage_STR
source: Can't analyze image
es: No se puede analizar la imagen
fr: Ne peut pas analyser l'image
pt: Não é possível analisar a imagem

# Resizing1ThereIsNotSufficientMemoryToResize_STR
source: Resizing 1: There is not sufficient memory to resize file! Required:
es: El tamaño 1: No hay memoria suficiente para cambiar el tamaño de archivo! Obligatorio:
fr: Redimensionnement 1: Il n'est pas suffisamment de mémoire pour redimensionner le fichier ! Obligatoire:
pt: Redimensionamento 1: Não há memória suficiente para redimensionar arquivos! Necessário:

# Resizing2ThereIsNotSufficientMemoryToResize_STR
source: Resizing 2: There is not sufficient memory to resize file! Required:
es: El tamaño 2: No hay memoria suficiente para cambiar el tamaño de archivo! Obligatorio:
fr: Redimensionnement 2: Il n'est pas suffisamment de mémoire pour redimensionner le fichier ! Obligatoire:
pt: Redimensionamento 2: Não há memória suficiente para redimensionar arquivos! Necessário:

# ResizeCanTAllocateBitmap_STR
source: Resize: Can't allocate bitmap
es: Tamaño: No se puede asignar el mapa de bits
fr: Redimensionner : Impossible d'allouer bitmap
pt: Redimensionamento: Não é possível alocar bitmap

# TotalAllocatedMemory_STR
source: Total allocated memory:
es: Total de memoria asignada:
fr: La mémoire alloué au total :
pt: Total alocado memória:

# BitmapMustBeAtLeast2InchesWide_STR
source: Bitmap must be at least 2 inches wide!
es: Mapa de bits debe ser al menos de 2 pulgadas de ancho.
fr: Bitmap doit être au moins 2 pouces de large !
pt: Bitmap deve ser pelo menos 2 polegadas de largura!
